# Создать вектор размера 10, заполненный числом N

import numpy as np
# pip install numpy

N = 0  # Замените 0 на любое число, которое вы хотите использовать

# Создаем вектор размера 10, заполненный числом N
my_vector = np.full(10, N)

# Выводим результат
print(my_vector)

