# Создать вектор размера 10, заполненный числом 0

import numpy as np
# pip install numpy

N = 5  # Замените 5 на любое число, которое вы хотите использовать

# Создаем вектор размера 10, заполненный числом N
my_vector = np.full(10, N)

# Выводим результат
print(my_vector)

